// js/config.js

export const firebaseConfig = {
    apiKey: "AIzaSyCkJ93viSMFWMuoraJcIohakdsVNBsQE9E",
    authDomain: "bunker-c9082.firebaseapp.com",
    databaseURL: "https://bunker-c9082-default-rtdb.europe-west1.firebasedatabase.app", 
    projectId: "bunker-c9082",
    storageBucket: "bunker-c9082.firebasestorage.app",
    messagingSenderId: "1069457346181",
    appId: "1:1069457346181:web:bc6ef8fe3eda8eef49a3ec"
};

export const sheetUrls = {
    names: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=516861620&single=true&output=csv",
    professions: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=1382198780&single=true&output=csv",
    health_diseases: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=609770703&single=true&output=csv",
    hobbies: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=1277297200&single=true&output=csv",
    additional_info: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=1243736491&single=true&output=csv",
    inventory: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=552616764&single=true&output=csv",
    phobias: "https://docs.google.com/spreadsheets/d/e/2PACX-1vTyQokwvg24mYfy4WHDvvF7oNWP6vJFTFCJp6jsxk2EgrG1rjykneazGmqSo4cvdKsk51k9EUGxkvZb/pub?gid=625829278&single=true&output=csv"
};

export const FIELD_NAMES = {
    gender: "Стать",
    age: "Вік",
    body: "Статура",
    profession: "Професія",
    health: "Здоров'я",
    phobia: "Фобія",
    hobby: "Хобі / Навички",
    inventory: "Рюкзак",
    info: "Дод. інформація",
    special1: "Стоп Бункер 1",
    special2: "Стоп Бункер 2"
};

export const CORE_FIELDS = ['gender', 'age', 'body', 'profession', 'health', 'phobia', 'hobby', 'inventory', 'info'];

export const imgMale = `<img src="man.jpg" alt="Чоловік" class="profile-photo-img">`;
export const imgFemale = `<img src="woman.jpg" alt="Жінка" class="profile-photo-img">`;

export const DEFAULT_SPECIALS = [
    "Змінити картку 'Здоров'я' всім гравцям на нову з колоди",
    "Змінити свою картку 'Здоров'я' на нову з колоди.",
    "Змінити картку 'Здоров'я' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Здоров'я' із вибраним гравцем.",
    "Вилікувати себе від будь-якої хвороби або травми.",
    "Відкрити картку 'Здоров'я' будь-якого гравця.",
    "Змінити картку 'Фобія' всім гравцям на нову з колоди",
    "Змінити свою картку 'Фобія' на нову з колоди.",
    "Змінити картку 'Фобія' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Фобія' із вибраним гравцем.",
    "Вилікувати себе від будь-якої фобії",
    "Відкрити картку 'Фобія' будь-якого гравця.",
    "Змінити картку 'Професії' всім гравцям на нову з колоди",
    "Змінити свою картку 'Професії' на нову з колоди",
    "Змінити картку 'Професії' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Професії' із вибраним гравцем.",
    "Відкрити картку 'Професія' будь-якого гравця.",
    "Змінити картку 'Хобі' всім гравцям на нову з колоди",
    "Змінити свою картку 'Хобі' на нову з колоди",
    "Змінити картку 'Хобі' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Хобі' із вибраним гравцем.",
    "Відкрити картку 'Хобі' будь-якого гравця.",
    "Отримати додаткову карту 'Хобі'",
    "Змінити картку 'Багаж' всім гравцям на нову з колоди",
    "Змінити свою картку 'Багаж' на нову з колоди.",
    "Змінити картку 'Багаж' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Багаж' із вибраним гравцем.(Вкрасти)",
    "Захистити карту 'Багаж' від крадіжки до кінця гри.",
    "Відкрити картку 'Багаж' будь-якого гравця.",
    "Отримати додаткову карту 'Багаж'",
    "Змінити картку 'Дод.Інформація' всім гравцям на нову з колоди",
    "Змінити свою картку 'Дод.Інформація' на нову з колоди.",
    "Змінити картку 'Дод.Інформація' гравцеві на вибір на нову з колоди",
    "Обмінятися картками 'Дод.Інформація' із вибраним гравцем.",
    "Відкрити картку 'Дод.Інформація' будь-якого гравця.",
    "Змінити картку 'Вік' всім гравцям на нову з колоди",
    "Змінити свою картку 'Вік' на нову з колоди.",
    "Змінити картку 'Вік' гравцеві на вибір на нову з колоди",
    "Відкрити картку 'Вік' будь-якого гравця.",
    "Змінити картку 'Стать' всім гравцям на нову з колоди",
    "Змінити свою картку 'Стать' на нову з колоди.",
    "Змінити картку 'Стать' гравцеві на вибір на нову з колоди",
    "Відкрити картку 'Стать' будь-якого гравця.",
    "Змінити картку 'Статура' всім гравцям на нову з колоди",
    "Змінити свою картку 'Статура' на нову з колоди.",
    "Змінити картку 'Статура' гравцеві на вибір на нову з колоди",
    "Відкрити картку 'Статура' будь-якого гравця.",
    "Змінити всім гравцям 'Досьє'",
    "Змінити собі 'Досьє'",
    "Змінити 'Досьє' гравцеві на вибір",
    "Змусити будь-якого гравця відкрити одну приховану картку на ваш вибір.",
    "Замінити собі карту на власний розсуд.",
    "Перероздати одну картку на вибір всім гравцям.",
    "Змусити іншого гравця голосувати так само, як і ви.",
    "Перенаправити всі голоси, віддані проти вас, на іншого обраного гравця.",
    "Заборонити одному гравцю голосувати на цьому ході.",
    "Пропуск голосування.",
    "Отримати імунітет до вигнання на наступному голосуванні.",
    "Заборонити використання карток 'Стоп Бункер' на цьому ході всім гравцям.",
    "Отримати право двох голосів на поточному голосуванні.",
    "Захистити іншого гравця від вигнання, але ви втрачаєте право голосу на наступному голосуванні.",
    "Захистити себе від вигнання на одне голосування, але ви втрачаєте право голосу на наступному голосуванні.",
    "Змусити гравця скинути свою картку 'Стоп Бункер' без використання.",
    "Оголосити диктатуру: на цьому ході ви одноосібно вирішуєте, хто покине бункер.",
    "Відкрити всі свої картки добровільно, щоб отримати імунітет на одне голосування."
];